{"quotes":["dang! i missed 1,111,111!!! lol","ok! getting caffeinated! dressed! and smashingwhatere food i can find into my face!","*my plan","@Michel Baumann, myelin todays rapid fire updates. damnbrokenspacebar! i am not in the office yet! my laptop has suffered this campaign!","lol, we broke kicktraq\nhttp://www.kicktraq.com/projects/poots/kingdom-death-monster-15/#chart-daily","@T. A. P., I've reported that comment as spam. do not advertise your pledge level for sale.","MORNING!\nFINAL DAY\nFINAL9HOURS \nMYSPACEBARISBROKEN!LOL","I heard we are out of Frogdog Pledge levels!","AND ITS UP!!!!","DUN DUN DUNNNNN","UPDATE!!!","OK! NOW ITS TIME TO WORK ON UDPATES!!!","Gamers Lantern up! It's just a minor discount on the already heavily discounted kickstarter prices for the core game + all the expansions (current &amp; new) with a t-shirt and dice thrown in!","@Cookie Assassin, just add em up!","Most fair pledge level for me yet!","Percival's Lantern Pledge Level Added!","Ok, last day. Last hours. LETS DO THIS!","@Superschrubber, I would think most biz men would shy away from stating things so bluntly. To me, its being upfront and responsible. We have been partying for over a month now. Nothing wrong with a little expectation management.","@FredeRic Out to Get kDm Old Gem, its quite alright! We are the #1 funded game on kickstarter. It was simply time to manage some expectations. I will deliver the shit out of this campaign!","@TheAwaitedKing, there are 2 expansions left to reveal. The unplanned one for hitting 6,666,666 and the final planned expansion on the last day.","Sorry to have to get serious. But managing expectations and ensuring the project is seen thru to the end is my ultimate responsibility.","@andrew fernandes, thanks will fix tomorrow!","AND WE ARE UPPP!!!!","God, i just can't image comp / type fast enough!","Incoming Death Chicken!","Wow! I just got thru the meetings with the artist and team, and the goal has already been cracked! Augghhh!!!","@Markus, strictly setting book. Most likely never. KD is about show, not tell. Laying out the history-less world would ruin it. I DO want to make an RPG one day tho. But it will take some time to figure out how to do that in the right way for us.","@Sinflon, there is a white d10 and hit location die.","I am sleepy, but pretty excited!","dang, thats so many comments so fast!","GOOOD MORNINGGGGGGGGGG","@Paul...how thefuck?","@Richard Yong,VB has a front page link now!","@I believe in a thing called death, correct!","@Chris Silver, what the butts are you talking about?","oops, forgot something very important and serious. i have added it now.","UPDATE IS UP!!!!","update is an update teaser!","Dang. This is crazy!","Hahaha! We have so many links on the main page, we hit the character LIMIT! I have to go back thru and convert everything to tinyurl's lolololol","Figured the Gambler would make for a perfect post-campaign header image!","But I mean, think about how much Car Boyz I could play!","Just being real you know. Like. BOOOOOOM!!!!!!!","Why is this so attractive to me right now?\nhttp://www.kingdomdeath.com/downloads/just-noticed-this-why-is-it-tempting.png","21 minutes left. I have to say, feeling pretty strange!","@Ringtailfox Fans, I jokingly promised Anna that I wouldn't put up the Ringtail Fox Set, unless we hit $13M. Don't worry, I am super excited to create it. It just won't be part of this Kickstarter Campaign. It's scope got so big, It would end up being its own core game!","ALLRIGHT. HERE IT COMES!!!!!!! FINAL UPDATE!!!!!","@Dingerzat, Yes CROSSOVERS are not KS exclusive. But they will be available in limited ways. Con's special sales. They are not MY IP so anything I do with them I need approval. I want to make sure we treat them right, as awesome as they are!","STARTING WORK ON THE FINAL UPDATE!!!!!","Returning Gamers Lantern Up!","@Kitos, I agree. and with that, i focus fully on update.","@Michael Berné, can anyone really stop me from going full yolo?","@KShinto, our domestic shipping partner is awesome.","@Brooks, yep. I am just sitting here. Relaxing. Not working hard at all. Not answering messages, not communicating with artists. Easy breezy.","@Steve, KS and con's only. Each IP owner will also get an allotment of units, which they will sell separately.","@Flintlock Jack - Great Game Hunter, omg. Why haven't I thought of this yet? THIS IS AMAZING!","DICE HAVE BEEN ROLLED!","3 days to go! Tho its more like 4 days, since we end 6pm set on saturday!","@The Captain, worst case I'll draw crappy stick figure stand-ins and just describe what should be there. Then we can hammer it out when we have more time. lol","Its going to be a late update I am afraid. I don't want it to be, because I really like to eat dinner at a table and not in front of the computer... But that's how it will be!","@Kelly Lynch of FrogDog Support Campaign, lol. Alright. Might be a nice little diagram to add to the online glossary. But that sort of level of... geez I don't even know. Being too  specific, can end up undermining people's understanding of other rules, wherein they are technically correct but not over explained to the same level. Then you end up in the dreaded \"well it doesn't say you 'CANT' territory\". I am mega proud of our rules. KD is a huge game, that is both technically accurate and human understandable. I will need to decide what goes into the online FAQ vs what actually makes it into the rulebook.","@GLp, don't wait. Sleep! It will be here for you in the morning!","@Kelly Lynch of FrogDog Support Campaign, typo's yes please! I found one on White Secret, Story of the Impossible hairs. Should be \"belonged\" and not belong. Would you believe this went thru 3 professional copy editors?","@Kelly Lynch of FrogDog Support Campaign, Really? People don't understand you can attack the blue spaces? It's two spaces away!","@Kelly Lynch of FrogDog Support Campaign, awesome!","@Evan Hissey, yeah I thought our front page would be fully updated today. The guy I have working on it is still getting his speed level up to par. Should be all sorted tomorrow. But God Frog Dog is easy, EVERY expansion, EVERY pinup, EVERY promo. Right now the only thing not included are crossovers and the exclusive  t-shirts from other levels.\n\nB","@Tristan High Cultist of Cthulhu, everything is already nearly 50%off. I am afraid, that is the best I can do!","@Peter Bowie, hunter x hunter also has a very \"Cell\" inspired villain. Of course I can't confirm if that was an inspiration or not. Tho, he was an Ant King and not an Android,","We've got Mr. Zach Barash in and he is going to help me organize and get this all together. So I wanted to check to see if the community had started it yet!","AND ITS UP!","Our expansions are not cookie cutter.","@Matt Darrah, just because something has the same node. Does not mean you can't have them in the same campaign. Each monster has different levels and different rewards / gear that can be made from them. The node system will be designed to prevent you from OVERLOADING a campaign, or putting in too much content that either does not allow you to progress, or conversrly makes a campaign too easy.","@ArtSchool, its kind of impossible since we have yet to develop it yet.","Sooo... I got the exact roll I wanted to on the Gambler's Chest today. This is the 2nd time that's happened. Sort of amazing, but also sort of spooky!","I am not trolling. Watchers devour progress. Thus, there is no history.","@Tias - Ringtail Fox Preacher, there are no maps or history in KD.","Did that errata / type shared doc get started by the community?","and its up!!!!","So I am thinking a quick, were back update followed up with a bigger update later in the day? How does that sound?","We are back!","Happy New Years everyone!!!! Myself and the team will be back in full swing tomorrow!","Merry Xmas!!!!!!!!!!!!!!!!!","DING DING DING! First Response was a confirmed dare!","Anyone dare me to replace the xmas gift with a box of salt?","@Mark Handford, that's because waiting sucks! I don't want to wait either! lol","Oh my. That got a lot higher from when I went to sleep.","I am going to bed before I explode and can't sleep!!!!","http://media.animevice.com/uploads/0/69/545800-default_image__scouter__object_page__large.png","http://media.animevice.com/uploads/0/69/545800-default_image__scouter__object_page__large.png","OVER 9 MILLLIOOONNNNNN!!!!!!!!!","@TheAwaitedKing, now why would I spoil anything at this late stage of the campaign?","With the change to the Gambler's Chest. The chains holding me have been released. I AM NOW SUPER STOKED ABOUT OUR LAST DAYS!!!!!","If you wanna skirt the system, you'd have to create a new account and take a pledge that has a reward + the Gambler's Chest. But it at least, discourages what I suspect is gonna happen on eBay. lol","Gambler's Chest, here is what we are talking about internally here. The Add-On price is increased to $150. If you have a Black Friday Lantern pledge, you can add 1 to your rewards for $100. This way, everyone can have 1 at it's original price.","@bugula - Troller of Trolls &amp; Winged Apes, wait until I make official announcements. I might leave everything as it is for now. Then make changes down the road if we re-open the pledge manager for a weekend for super late backers like we did in the past. Right now its Poots vs Math.","@Kelly Lynch of FrogDog Support Campaign, on the base inserts? It was Thomas David. We had to clean them up after we scanned them for the hard plastic release. The art restoration was done by a Zbrush artist named Jin.","@Paul Johnson, where would the fun be if I answered this directly?","@Fool, Optimistically Pessimistic, Its surreal and amazing. But also very scary. Doing awesome things like making the neko knight an add to the GC, instead of making it an add on promo, has an extreme cost now that we have 16,000 backers! I love being generous and crazy. But I really can easily sink the battleship. Hence, the mortal terror i am feeling! lol","@Ciro, I am waiting on art for the 3 most \"interesting\" things that will go into the box. Getting down to the wire tho! lol","@Eli Curtz, yeah. Maybe I'll do that today. We don't support group pledges. It was an absolute nightmare last time and lead to police reports and all sorts of nonsense as people laid into each other. NO THANK YOU. The Gambler's Chest is most likely going to be 1 per pledge at $100, and be more expensive for any ones beyond that. Same with the Core Game. I am super aware that people can get around this by making more accounts. But it certainly discourages the behavior.","@Brasilian Engineer, yep! Before each wave ships we will collect shipping fee's and an address.","@Ciro, thats not very nice! lol","Basically, I am confident we won't see anything like that happen again. You know, unless I promise something ridicules on the last day, in the final hour. lol","@eWave, part of the reason I canceled the Lantern Festival, was to bring the new node / campaign system structure into place. Everything presented fits within the scope of the game experience we now know very well. The Lantern Festival, was set to go too far beyond that scope and it ended up feeling like it needed to be its own game, with its own expansions. Similar to EPIC level D&amp;D, with its own EPIC level adventure modules.","@The Inner Geek, dunno how many upgrades we need to print. We have 5,000 slatted.","@Bramithra, not sure. How would you feel if you didn't make the cut and Core Games were up on eBay before you got yours a few months later?","@Orion Free, yeah it might get sucky fast. Too many exceptions dilutes the experience.","@bugula - Troller of Trolls &amp; Winged Apes, indeed. It would only be for \"extra\" copies. Still all big if's right now.","@Edward, we have 10,000 units in print. Due to the size of this campaign, I am not sure if that will be enough, which will lead to delays.","@Thomas, IF we implement the change, you would actually add the +$100 now since no details about the pledge manager have been revealed as of yet. Right now the GC is +$100 as an add-on and is unrestricted. Since we have added so much, its starting to become a bit of an issue production wise. lol. Ideally, I’d like to not change anything, as its complicated.\n\n@Paul Johnson, required is required. I’d rather focus everything into making that experience as awesome as possible and not have to worry about what mixture of expansions each fan might have.","@Paul Johnson, whats up?","@Christian of the UaPaDanAaTanE clan, IF we implement this change. You can still get 1 at $100, since you have a black friday lantern pledge. But if you want extra's beyond that, it'll be $150. I am trying to discourage group and bulk pledges. It was far more hassle then it was worth last kickstarter.","@Mike no hope left for the fox, art is art and will forever be just that. if i give up on that very simple fact now, what was all this struggling for?","@Shane, is that even a real stretch?","@Mike no hope left for the fox, I don't care who attacks me. I can take it. I care a lot when our fans, backers and bakcers are attacked.","I think its time... I finally post our first real stretch goal. How does $10M sound?!","Had 2 interviews today, haven't gotten a chance to work on the update yet. No sleep for me tonight... nuuuuuu!","@Paul Johnson, yes PayPal + Crowdfunding = no good!","@Jack Ordonez, thats up to kickstarter and however dumb they want to make me look wooo!","kickstarter is here, having an interview with them right now! lol","@ShaneXD Unfruited!, I urge everyone to pledge responsibly! Seriously!","@Mairtin *Infinitely Untrustworthy*, I backed Gloomhaven as a late backer. Looking forward to playing it!","And its up!!!","If I go Yolo Crazy, I'd have to break the *all* limit and push content that isn't included in any pledge levels. Otherwise you know. budget, explosions. Financial ruin, woo!","@Isryu - Ringtail Fox Hopeful, so just normal crazy then.","@warpkun, brolyis too ragey, he could never reach the calm centered state that is required of a super survivor god.","How crazy should I go the last day? Normal Crazy, Moderate Crazy or 100% no looking back, YOLO crazy?","INDEED YES!","Skipping making the video and picking the roll tonight, for the sake of speed and my own sanity! Also, its thematic! lol","@andrew fernandes, but broly is less powerful then a SSG. It wouldn't even be a fight!","@Kelly Lynch of FrogDog Support Campaign, anyway. I really appreciate you collecting this. Even if at times it can be a little bit of an eye roller. It will help myself and the team as we move forward, developing more stuff!","@Alistair, no actually! lol","holy crap, nearly 8.3!","@poeticallybored 1. Nope.\n2. 1.5 Has a new step during the Settlement Phase that checks for milestone events. As stuff like this + simply forgetting them was common.\n3. Of course! Just add it to the sunstalker expansion to the timeline where the king’s man was. Or put it at the very end, either would be fun!\n4. Auto hits are NOT perfect hits. Here is the glossy entry from our living glossary: Automatic hits happen in the place of attack rolls. When a survivor attacks, they make attack rolls equal to their weapon's Speed (plus modifiers). Each automatic hit foregoes one of these rolls and adds 1 to the total number of hits when hits are determined. The remaining attack rolls are performed normally, and all hits (rolled or automatic) are drawn and resolved together. Automatic hits are not Perfect hits.\n*added 10.27.15","@Eyne Nacht, My official break is dec 24 - jan 1st. But I am sure once guests leave I'll start to check up on things and follow up with artists. But at a much much more leisurely pace. Need the energy to hit the campaign as hard as I can in our last week!","@Brandon Holmes, ah. Sorry Brandon I can't, since it hasn't been developed yet. I don't want to make a promise here that we are bound to.","@raivutz, the final planed expansion will go up today.","@The Dragon King, haha. I am trying to manage expectations a little bit. At a certain point, I simply can't add any more otherwise the whole budget capsizes.","@The Dragon King, ah exactly. The 10 new expansions that are not included in any pledge levels and are add-ons only you mean?","@raivutz, im not working xmas eve, day, or the few days following. no way!","@Ciro Saborit Sanz, because its more interesting a concept to develop around!","@Kelly Lynch of FrogDog Support Campaign, haha, yeah we can prob put together an estimated chart! Not final of course. My extra help got sick today, ugh! lol","@Dr Manhattan, soon as I make that pledge level, it ties my hands for adding new expansions.","Added the two unofficial fan created pledge guides / helpers to the campaign page, right at the top!","Or this one?\nhttps://stdobby.github.io/kingdomdeath/","What pledge level tracker is everyone using? Is it this one?\nhttps://docs.google.com/spreadsheets/d/1yongANgzTydc244aWDJyFoHhTBDBKWpGuF6CtlN6jEc/edit#gid=0","@Marian Hilgers, all backers, retailers or not, need to pay for their shipping. Whatever costs we incur will be passed on. Since there are 6 games in that pledge level, its basically shipping 6 core games. There is no way to pack them all into one carton. It's too heavy and the contents would crush / damage each other.","Good Morning! 4 days until the moon crashes into us all!","@David Bousquet, if I FULL YOLO the prices of the things I introduce will be full retail and not included in any pledge levels. This would be to avoid capsizing the campaign. Better If I keep things under the tiny amount of self control I have left!","@Possessor of UaPaDanAaTanE underpants, best comment yet!","@Tias - GIVE US RINGTAIL FOX EXPANSION, too bad it wasn't \"exploding foxes\" eh?","Night!!!! Tomorrow is my last day before I take a break for the holidays!","@VoidWolf , between kickstarter and the company that handles the money its like 8-10% that gets taken out. And yeah, thats something I've had to factor into all the prices. Its kinda nuts, but it is what it is!","Only 7 mins late today! woooo!","@Mark, im not off yet. Working today and tomorrow!","@Sarevok, wow. I wonder how many times backers have actually asked for the creator to get off the comment board! Amazing!","@Paul Johnson, that looks about right.","Savior Nerf\nRight now their power scales too quickly, is too useful and they live for too long. They are going to be downgraded more to feel like a survivor +, each with an ability that on use, ages them. For example, a Red survivor can make a miss an automatic hit by at the cost of 1 age level. Because of how much this sucks, compared to their original incarnation. Each Savior can access a secret fighting art, its use using the remainder of their lifetime. But it will take a little bit of work to learn / gain each of those arts. This puts them more in line with the bonus they were meant to be, instead of a core game strategy as I have seen many people use. For example, Strategy vs the King's Man level = a green savior. You can win that fight with just normal survivors, I have many times. The answer myself and the playtest team found = dash, a single shield or ranged weapon and daggers. Controlling whom it attacks and dash canceling it as often as possible will very often lead to victory. I don't wanna spoil anything more, so I will leave it at that.","Ok I am going to answer the Savior Question, then get out of here.","@TJ Jackson, neither the Hand or I care and you will always have our applause for playing the game. But if you want respect well... lol! You get what I mean tho right?","@Paul Johnson, I don't disagree with this.","UPDATE IS UPDATE!","@Ciro, I agree. Hence why its not final.","Main page updated with some answers to common questions that are being sent to me every few seconds!","ONLY 62 HOURS!","Been dropping mint eyedrops into my eyes to stay awake. lol","I gotta sleep @_@","Its uP!","WOOO!!! I rolled a 13!!!!!","@Karlthepug, yeah thats no big deal.","How should we celebrate 16,666 backers?"]}
